thuyavansc/esp32s3_board_test/sdkconfig.defaults
# sdkconfig.defaults — esp32s3_board
#
# Only OVERRIDES from ESP-IDF's own factory defaults live here (doc 92 §2.2)
# — never a full generated sdkconfig. If you add/change anything below,
# delete sdkconfig.esp32s3_board and run `pio run -t clean -e esp32s3_board`
# before `pio run` again — the generated file is CACHED and silently
# ignores sdkconfig.defaults edits otherwise (doc 92 §5 — this exact trap
# already cost 2+ days on esp32_display_taxi and esp32_chip_info_test).

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_WIFI_STA_SUPPORT=y
CONFIG_ESP_WIFI_SSID_CONFIG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ── TLS ──────────────────────────────────────────────────────────────
# CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN = max size of a single INCOMING TLS
# record mbedTLS can buffer. ESP-IDF's own factory default is 16384 (16KB,
# the full TLS-standard max). A prior project (esp32_chip_info_test)
# copied a WROOM-only RAM-saving hack (4096) into this same setting and
# it caused a 2+ day HTTPS binary-download failure against every real
# internet server tried (certificate validated, then a raw TLS read
# error mid-transfer) — see
# docs/TestFunctionalities/ota-updates/73_2026-07-14_postmortem_ota_download_fix_complete.md.
# This board has 8MB PSRAM — there is no RAM pressure reason to shrink
# this here, so it stays at the real ESP-IDF default.
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_VARIABLE_BUFFER_LENGTH=y
CONFIG_MBEDTLS_HARDWARE_MPI=n

# mbedTLS memory allocation mode — ESP-IDF's own factory default is
# MBEDTLS_INTERNAL_MEM_ALLOC (internal SRAM only, for every allocation
# mbedTLS makes: TLS session buffers, X.509 parsing, RSA/ECC verify
# scratch math). On this board that pool is small and shared with WiFi/
# every task's stack/LVGL/both GPS UART read tasks, and under load this
# caused real HTTPS failures (esp-x509-crt-bundle "PK verify failed" /
# mbedtls_ssl_handshake -0x3000, decoding to MBEDTLS_ERR_MPI_ALLOC_FAILED
# — see docs/TestFunctionalities/esp32s3_board/143_2026-07-25_https_tls_
# failure_mbedtls_memory_allocation_analysis.md). This board has 8MB
# PSRAM with no such contention — switching mbedTLS to draw from it
# instead removes the failure for every HTTPS call project-wide (doc
# 145 §1). Trade-off (accepted, see doc 145 §3): TLS working memory now
# crosses the external PSRAM bus instead of staying on-chip-only — a
# physical-access security nuance, not a functional one, and this board
# doesn't have flash encryption enabled to close that gap anyway.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16

# ── Flash — 16MB, confirmed via esptool flash_id on this board family ──
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# ── PSRAM — 8MB embedded Octal, confirmed on this board family ────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# ── App rollback — required for the always-on "factory reset" safety
# net (factory_reset.c) even while ENABLE_OTA=0 in config.h; it still
# calls esp_ota_set_boot_partition()/esp_restart() against a real
# factory/ota_0/ota_1 partition layout (partitions_16mb.csv).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ── Storage — SPIFFS "storage" partition (trips_api.c) ────────────────
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_SPIFFS_USE_MTIME=y
CONFIG_SPIFFS_OBJ_NAME_LEN=128

# ── LVGL — display feature (ported from esp32_display_taxi_3) ────────
# LV_MEM_SIZE_KILOBYTES is capped at 128 by LVGL 8.3's own Kconfig
# (range 2-128) — NOT a PSRAM candidate regardless (see doc 111/112):
# this exact UI already runs fine at 128KB on a WROOM board with far
# less total SRAM than this S3 board has free.
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_COLOR_16_SWAP=1
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_DISP_DEF_REFR_PERIOD=30
CONFIG_LV_INDEV_DEF_READ_PERIOD=30
CONFIG_LV_TICK_CUSTOM=1
CONFIG_LV_TICK_CUSTOM_INCLUDE="freertos/FreeRTOS.h"
CONFIG_LV_TICK_CUSTOM_SYS_TIME_EXPR="(xTaskGetTickCount() * portTICK_PERIOD_MS)"
CONFIG_LV_USE_LOG=0
